<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads ArchiCad20 dmg and imports into Munki.</string>
    <key>Identifier</key>
    <string>de.macworx.munki.ArchiCAD20</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps</string>
        <key>NAME</key>
        <string>ArchiCAD20</string>
        <key>COUNTRY</key>
        <string>GER</string>
		<key>URL</key>
		<string>http://dl.graphisoft.com/AC/20/%COUNTRY%/AC/ARCHICAD-20-%COUNTRY%-3012-1.3.dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%URL%</string>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Versioner</string>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/ArchiCAD 20/ArchiCAD Installer.app/Contents/Info.plist</string>
			</dict>
		</dict>
        <dict>
	        <key>Processor</key>
	        <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
				<key>pkginfo</key>
				<dict>
					<key>description</key>
					<string>ArchiCAD 20 offers a streamlined workflow solution, keeping architects in the state of the creative design flow with as little disruption as possible.</string>
					<key>installer_type</key>
					<string>copy_from_dmg</string>
					<key>installs</key>
					<array>
						<dict>
							<key>CFBundleIdentifier</key>
							<string>com.graphisoft.ArchiCAD</string>
							<key>CFBundleName</key>
							<string>ArchiCAD</string>
							<key>CFBundleVersion</key>
							<string>%version%</string>
							<key>minosversion</key>
							<string>10.7.0</string>
							<key>path</key>
							<string>/Applications/GRAPHISOFT/ArchiCAD 20/ArchiCAD 20.app</string>
							<key>type</key>
							<string>application</string>
							<key>version_comparison_key</key>
							<string>CFBundleVersion</string>
						</dict>
					</array>
					<key>items_to_copy</key>
					<array>
						<dict>
							<key>destination_path</key>
							<string>/tmp</string>
							<key>group</key>
							<string>admin</string>
							<key>mode</key>
							<string>go-w</string>
							<key>source_item</key>
							<string>ArchiCAD 20/ArchiCAD Installer.app</string>
							<key>user</key>
							<string>root</string>
						</dict>
					</array>
					<key>name</key>
					<string>%NAME%</string>
					<key>postinstall_script</key>
					<string>#!/bin/sh
				
					LWPID=`ps axww | grep loginwindow | grep -v grep | awk '{print $1}'`
	
					JAR="/tmp/ArchiCAD Installer.app/Contents/Resources/Java/archive.jar"
	
					launchctl bsexec $LWPID java -jar "$JAR" -W play.auto=YES -silent
					
					success=$?
					
					rm -f "/Users/$USER/Desktop/ArchiCAD 20"
					rm -f "/Users/$USER/Desktop/BIMx for ArchiCAD 20"
					
					exit $success
					</string>
					<key>requires</key>
					<array>
						<string>JavaForOSX</string>
						<string>WibuKey</string>
						<string>CodeMeter</string>
					</array>
					<key>uninstall_method</key>
					<string>uninstall_script</string>
					<key>uninstall_script</key>
					<string>#!/bin/sh

					LWPID=`ps axww | grep loginwindow | grep -v grep | awk '{print $1}'`

					JAR="/Applications/GRAPHISOFT/ArchiCAD 20/Uninstall.AC/archive.jar"

					launchctl bsexec $LWPID java -jar "$JAR" -W play.auto=YES -silent

					exit $?
					</string>
					<key>version</key>
					<string>%version%</string>
				</dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>